# -*- coding: utf-8 -*-            
# @Time : 2024/3/27 15:18
# @name: scy
# @FileName: __init__.py.py
# @Software: PyCharm

# 用来获取数据，可用作初始化

from crawler.job51 import get_data

ls = [
    "计算机",
    "临床医学",
    "会计",
    "电气工程及其自动化",
    "金融",
    "软件工程",
    "建筑",
    "法律",
    "机械",
    "电子信息",
    "英语",
    "人工智能",
    "经济",
    "工商管理",
    "电子商务",
    "土木工程",
    "通信工程",
    "汉语言文学",
    "水利",
    "力学",
    "学前教育",
    "物理",
    "生物",
    "化学",
    "地理",
    "历史",
    "销售客服",
    "行政助理",
    "物流采购",
    "外贸业务",
    "IT技术",
    "财务金融",
    "工程技术",
    "房地产",
    "生物医药",
    "服务行业",
    "电子商务经理",
    "健康与福祉顾问",
    "网络安全工程师",
    "区块链开发者",
    "虚拟现实设计师",
    "碳管理师",
    "能源管理师",
    "人工智能工程师",
    "ESG商业分析师"
]

if __name__ == '__main__':

    for specialty in ls:
        get_data(specialty)
        print(specialty)
